// Задача №6
// Написать программу вычисления значения функции y = sin(a). 
//(Класс Math)

int a=45;
int y;
Math.Sin(a);
System.Console.WriteLine(y);
