// Задача №6
// Написать программу вычисления значения функции 
//y = sin(a). 
//(Класс Math)

double x,y;
x=3.14;
y=Math.Sin(x);
System.Console.WriteLine($"sin{x}={y}");
