// Задача №8
// Вывести на экран числа от -N до N
int N = 70;
int i = -70;
while (i <= N)
{
    System.Console.Write($"{i} "); // Команда для вывода в ОДНУ строку через пробел
    i = i + 1; // ЗАДАЕМ ЧЕТНОСТЬ И НЕЧЕТНОСТЬ ДАННОЙ КОМАН
}